tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1776_tdd.h
#define G1DBF4                        2207
#define COG1DBF_DBF4                  2208
#define G1DBF5                        2209
#define COG1DBF_DBF5                  2210
#define COG1CON0                      2211
#define COG1CON0_MD                   2212
#define G1MD0                         2213
#define COG1CON0_MD0                  2214
#define G1MD                          2215
#define G1MD1                         2216
#define COG1CON0_MD1                  2217
#define G1MD2                         2218
#define COG1CON0_MD2                  2219
#define COG1CON0_CS0                  2220
#define G1CS                          2221
#define G1CS0                         2222
#define COG1CON0_CS                   2223
#define COG1CON0_CS1                  2224
#define G1CS1                         2225
#define G1LD                          2226
#define COG1CON0_LD                   2227
#define COG1CON0_EN                   2228
#define G1EN                          2229
#define COG1CON1                      2230
#define COG1CON1_POLA                 2231
#define G1POLA                        2232
#define COG1CON1_POLB                 2233
#define G1POLB                        2234
#define COG1CON1_POLC                 2235
#define G1POLC                        2236
#define COG1CON1_POLD                 2237
#define G1POLD                        2238
#define COG1CON1_FDBS                 2239
#define G1FDBS                        2240
#define COG1CON1_RDBS                 2241
#define G1RDBS                        2242
#define COG1RIS0                      2243
#define COG1RIS0_RIS0                 2244
#define G1RIS0                        2245
#define COG1RIS0_RIS1                 2246
#define G1RIS1                        2247
#define COG1RIS0_RIS2                 2248
#define G1RIS2                        2249
#define COG1RIS0_RIS3                 2250
#define G1RIS3                        2251
#define COG1RIS0_RIS4                 2252
#define G1RIS4                        2253
#define COG1RIS0_RIS5                 2254
#define G1RIS5                        2255
#define COG1RIS0_RIS6                 2256
#define G1RIS6                        2257
#define COG1RIS0_RIS7                 2258
#define G1RIS7                        2259
#define COG1RIS1                      2260
#define COG1RIS1_RIS8                 2261
#define G1RIS8                        2262
#define COG1RIS1_RIS9                 2263
#define G1RIS9                        2264
#define G1RIS10                       2265
#define COG1RIS1_RIS10                2266
#define G1RIS11                       2267
#define COG1RIS1_RIS11                2268
#define G1RIS12                       2269
#define COG1RIS1_RIS12                2270
#define G1RIS13                       2271
#define COG1RIS1_RIS13                2272
#define G1RIS14                       2273
#define COG1RIS1_RIS14                2274
#define G1RIS15                       2275
#define COG1RIS1_RIS15                2276
#define COG1RSIM0                     2277
#define G1RSIM0                       2278
#define COG1RSIM0_RSIM0               2279
#define G1RSIM1                       2280
#define COG1RSIM0_RSIM1               2281
#define G1RSIM2                       2282
#define COG1RSIM0_RSIM2               2283
#define G1RSIM3                       2284
#define COG1RSIM0_RSIM3               2285
#define G1RSIM4                       2286
#define COG1RSIM0_RSIM4               2287
#define G1RSIM5                       2288
#define COG1RSIM0_RSIM5               2289
#define G1RSIM6                       2290
#define COG1RSIM0_RSIM6               2291
#define G1RSIM7                       2292
#define COG1RSIM0_RSIM7               2293
#define COG1RSIM1                     2294
#define COG1RSIM1_RSIM8               2295
#define G1RSIM8                       2296
#define COG1RSIM1_RSIM9               2297
#define G1RSIM9                       2298
#define G1RSIM10                      2299
#define COG1RSIM1_RSIM10              2300
#define G1RSIM11                      2301
#define COG1RSIM1_RSIM11              2302
#define G1RSIM12                      2303
#define COG1RSIM1_RSIM12              2304
#define G1RSIM13                      2305
#define COG1RSIM1_RSIM13              2306
#define G1RSIM14                      2307
#define COG1RSIM1_RSIM14              2308
#define G1RSIM15                      2309
#define COG1RSIM1_RSIM15              2310
#define COG1FIS0                      2311
#define G1FIS0                        2312
#define COG1FIS0_FIS0                 2313
#define G1FIS1                        2314
#define COG1FIS0_FIS1                 2315
#define G1FIS2                        2316
#define COG1FIS0_FIS2                 2317
#define G1FIS3                        2318
#define COG1FIS0_FIS3                 2319
#define G1FIS4                        2320
#define COG1FIS0_FIS4                 2321
#define G1FIS5                        2322
#define COG1FIS0_FIS5                 2323
#define G1FIS6                        2324
#define COG1FIS0_FIS6                 2325
#define G1FIS7                        2326
#define COG1FIS0_FIS7                 2327
#define COG1FIS1                      2328
#define G1FIS8                        2329
#define COG1FIS1_FIS8                 2330
#define G1FIS9                        2331
#define COG1FIS1_FIS9                 2332
#define G1FIS10                       2333
#define COG1FIS1_FIS10                2334
#define G1FIS11                       2335
#define COG1FIS1_FIS11                2336
#define G1FIS12                       2337
#define COG1FIS1_FIS12                2338
#define G1FIS13                       2339
#define COG1FIS1_FIS13                2340
#define G1FIS14                       2341
#define COG1FIS1_FIS14                2342
#define G1FIS15                       2343
#define COG1FIS1_FIS15                2344
#define COG1FSIM0                     2345
#define COG1FSIM0_FSIM0               2346
#define G1FSIM0                       2347
#define COG1FSIM0_FSIM1               2348
#define G1FSIM1                       2349
#define COG1FSIM0_FSIM2               2350
#define G1FSIM2                       2351
#define COG1FSIM0_FSIM3               2352
#define G1FSIM3                       2353
#define COG1FSIM0_FSIM4               2354
#define G1FSIM4                       2355
#define COG1FSIM0_FSIM5               2356
#define G1FSIM5                       2357
#define COG1FSIM0_FSIM6               2358
#define G1FSIM6                       2359
#define COG1FSIM0_FSIM7               2360
#define G1FSIM7                       2361
#define COG1FSIM1                     2362
#define COG1FSIM1_FSIM8               2363
#define G1FSIM8                       2364
#define COG1FSIM1_FSIM9               2365
#define G1FSIM9                       2366
#define COG1FSIM1_FSIM10              2367
#define G1FSIM10                      2368
#define COG1FSIM1_FSIM11              2369
#define G1FSIM11                      2370
#define COG1FSIM1_FSIM12              2371
#define G1FSIM12                      2372
#define COG1FSIM1_FSIM13              2373
#define G1FSIM13                      2374
#define COG1FSIM1_FSIM14              2375
#define G1FSIM14                      2376
#define COG1FSIM1_FSIM15              2377
#define G1FSIM15                      2378
#define COG1ASD0                      2379
#define COG1ASD0_ASDAC0               2380
#define G1ASDAC0                      2381
#define COG1ASD0_ASDAC                2382
#define G1ASDAC                       2383
#define COG1ASD0_ASDAC1               2384
#define G1ASDAC1                      2385
#define G1ASDBD0                      2386
#define COG1ASD0_ASDBD0               2387
#define G1ASDBD                       2388
#define COG1ASD0_ASDBD                2389
#define G1ASDBD1                      2390
#define COG1ASD0_ASDBD1               2391
#define G1ASREN                       2392
#define COG1ASD0_ARSEN                2393
#define G1ARSEN                       2394
#define COG1ASD0_ASREN                2395
#define COG1ASD0_ASE                  2396
#define G1ASE                         2397
#define COG1ASD1                      2398
#define COG1ASD1_AS0E                 2399
#define G1AS0E                        2400
#define G1AS1E                        2401
#define COG1ASD1_AS1E                 2402
#define COG1ASD1_AS2E                 2403
#define G1AS2E                        2404
#define COG1ASD1_AS3E                 2405
#define G1AS3E                        2406
#define G1AS4E                        2407
#define COG1ASD1_AS4E                 2408
#define G1AS5E                        2409
#define COG1ASD1_AS5E                 2410
#define G1AS6E                        2411
#define COG1ASD1_AS6E                 2412
#define G1AS7E                        2413
#define COG1ASD1_AS7E                 2414
#define COG1STR                       2415
#define G1STRA                        2416
#define COG1STR_STRA                  2417
#define G1STRB                        2418
#define COG1STR_STRB                  2419
#define G1STRC                        2420
#define COG1STR_STRC                  2421
#define G1STRD                        2422
#define COG1STR_STRD                  2423
#define COG1STR_SDATA                 2424
#define G1SDATA                       2425
#define COG1STR_SDATB                 2426
#define G1SDATB                       2427
#define COG1STR_SDATC                 2428
#define G1SDATC                       2429
#define COG1STR_SDATD                 2430
#define G1SDATD                       2431
#define COG2PHR                       2432
#define G2PHR0                        2433
#define COG2PHR_PHR                   2434
#define COG2PHR_PHR0                  2435
#define G2PHR1                        2436
#define COG2PHR_PHR1                  2437
#define G2PHR2                        2438
#define COG2PHR_PHR2                  2439
#define G2PHR3                        2440
#define COG2PHR_PHR3                  2441
#define G2PHR4                        2442
#define COG2PHR_PHR4                  2443
#define G2PHR5                        2444
#define COG2PHR_PHR5                  2445
#define COG2PHF                       2446
#define COG2PHF_PHF                   2447
#define COG2PHF_PHF0                  2448
#define G2PHF0                        2449
#define COG2PHF_PHF1                  2450
#define G2PHF1                        2451
#define COG2PHF_PHF2                  2452
#define G2PHF2                        2453
#define G2PHF3                        2454
#define COG2PHF_PHF3                  2455
#define COG2PHF_PHF4                  2456
#define G2PHF4                        2457
#define COG2PHF_PHF5                  2458
#define G2PHF5                        2459
#define COG2BLKR                      2460
#define G2BLKR0                       2461
#define COG2BLKR_BLKR                 2462
#define COG2BLKR_BLKR0                2463
#define G2BLKR1                       2464
#define COG2BLKR_BLKR1                2465
#define G2BLKR2                       2466
#define COG2BLKR_BLKR2                2467
#define G2BLKR3                       2468
#define COG2BLKR_BLKR3                2469
#define G2BLKR4                       2470
#define COG2BLKR_BLKR4                2471
#define G2BLKR5                       2472
#define COG2BLKR_BLKR5                2473
#define COG2BLKF                      2474
#define COG2BLKF_BLKF                 2475
#define G2BLKF0                       2476
#define COG2BLKF_BLKF0                2477
#define COG2BLKF_BLKF1                2478
#define G2BLKF1                       2479
#define COG2BLKF_BLKF2                2480
#define G2BLKF2                       2481
#define COG2BLKF_BLKF3                2482
#define G2BLKF3                       2483
#define COG2BLKF_BLKF4                2484
#define G2BLKF4                       2485
#define COG2BLKF_BLKF5                2486
#define G2BLKF5                       2487
#define COG2DBR                       2488
#define COG2DBR_DBR0                  2489
#define G2DBR0                        2490
#define COG2DBR_DBR                   2491
#define COG2DBR_DBR1                  2492
#define G2DBR1                        2493
#define COG2DBR_DBR2                  2494
#define G2DBR2                        2495
#define COG2DBR_DBR3                  2496
#define G2DBR3                        2497
#define COG2DBR_DBR4                  2498
#define G2DBR4                        2499
#define COG2DBR_DBR5                  2500
#define G2DBR5                        2501
#define COG2DBF                       2502
#define G2DBF                         2503
#define G2DBF0                        2504
#define COG2DBF_DBF0                  2505
#define G2DBF1                        2506
#define COG2DBF_DBF1                  2507
#define G2DBF2                        2508
#define COG2DBF_DBF2                  2509
#define G2DBF3                        2510
#define COG2DBF_DBF3                  2511
#define G2DBF4                        2512
#define COG2DBF_DBF4                  2513
#define G2DBF5                        2514
#define COG2DBF_DBF5                  2515
#define COG2CON0                      2516
#define COG2CON0_MD0                  2517
#define G2MD                          2518
#define G2MD0                         2519
#define COG2CON0_MD                   2520
#define COG2CON0_MD1                  2521
#define G2MD1                         2522
#define COG2CON0_MD2                  2523
#define G2MD2                         2524
#define G2CS                          2525
#define COG2CON0_CS                   2526
#define COG2CON0_CS0                  2527
#define G2CS0                         2528
#define COG2CON0_CS1                  2529
#define G2CS1                         2530
#define COG2CON0_LD                   2531
#define G2LD                          2532
#define G2EN                          2533
#define COG2CON0_EN                   2534
#define COG2CON1                      2535
#define G2POLA                        2536
#define COG2CON1_POLA                 2537
#define G2POLB                        2538
#define COG2CON1_POLB                 2539
#define G2POLC                        2540
#define COG2CON1_POLC                 2541
#define G2POLD                        2542
#define COG2CON1_POLD                 2543
#define COG2CON1_FDBS                 2544
#define G2FDBS                        2545
#define G2RDBS                        2546
#define COG2CON1_RDBS                 2547
#define COG2RIS0                      2548
#define G2RIS0                        2549
#define COG2RIS0_RIS0                 2550
#define G2RIS1                        2551
#define COG2RIS0_RIS1                 2552
#define G2RIS2                        2553
#define COG2RIS0_RIS2                 2554
#define G2RIS3                        2555
#define COG2RIS0_RIS3                 2556
#define G2RIS4                        2557
#define COG2RIS0_RIS4                 2558
#define G2RIS5                        2559
#define COG2RIS0_RIS5                 2560
#define G2RIS6                        2561
#define COG2RIS0_RIS6                 2562
#define G2RIS7                        2563
#define COG2RIS0_RIS7                 2564
#define COG2RIS1                      2565
#define COG2RIS1_RIS8                 2566
#define G2RIS8                        2567
#define COG2RIS1_RIS9                 2568
#define G2RIS9                        2569
#define COG2RIS1_RIS10                2570
#define G2RIS10                       2571
#define COG2RIS1_RIS11                2572
#define G2RIS11                       2573
#define COG2RIS1_RIS12                2574
#define G2RIS12                       2575
#define COG2RIS1_RIS13                2576
#define G2RIS13                       2577
#define COG2RIS1_RIS14                2578
#define G2RIS14                       2579
#define COG2RIS1_RIS15                2580
#define G2RIS15                       2581
#define COG2RSIM0                     2582
#define G2RSIM0                       2583
#define COG2RSIM0_RSIM0               2584
#define G2RSIM1                       2585
#define COG2RSIM0_RSIM1               2586
#define G2RSIM2                       2587
#define COG2RSIM0_RSIM2               2588
#define G2RSIM3                       2589
#define COG2RSIM0_RSIM3               2590
#define G2RSIM4                       2591
#define COG2RSIM0_RSIM4               2592
#define G2RSIM5                       2593
#define COG2RSIM0_RSIM5               2594
#define G2RSIM6                       2595
#define COG2RSIM0_RSIM6               2596
#define G2RSIM7                       2597
#define COG2RSIM0_RSIM7               2598
#define COG2RSIM1                     2599
#define G2RSIM8                       2600
#define COG2RSIM1_RSIM8               2601
#define G2RSIM9                       2602
#define COG2RSIM1_RSIM9               2603
#define COG2RSIM1_RSIM10              2604
#define G2RSIM10                      2605
#define COG2RSIM1_RSIM11              2606
#define G2RSIM11                      2607
#define COG2RSIM1_RSIM12              2608
#define G2RSIM12                      2609
#define COG2RSIM1_RSIM13              2610
#define G2RSIM13                      2611
#define COG2RSIM1_RSIM14              2612
#define G2RSIM14                      2613
#define COG2RSIM1_RSIM15              2614
#define G2RSIM15                      2615
#define COG2FIS0                      2616
#define G2FIS0                        2617
#define COG2FIS0_FIS0                 2618
#define G2FIS1                        2619
#define COG2FIS0_FIS1                 2620
#define G2FIS2                        2621
#define COG2FIS0_FIS2                 2622
#define G2FIS3                        2623
#define COG2FIS0_FIS3                 2624
#define G2FIS4                        2625
#define COG2FIS0_FIS4                 2626
#define G2FIS5                        2627
#define COG2FIS0_FIS5                 2628
#define G2FIS6                        2629
#define COG2FIS0_FIS6                 2630
#define G2FIS7                        2631
#define COG2FIS0_FIS7                 2632
#define COG2FIS1                      2633
#define G2FIS8                        2634
#define COG2FIS1_FIS8                 2635
#define G2FIS9                        2636
#define COG2FIS1_FIS9                 2637
#define COG2FIS1_FIS10                2638
#define G2FIS10                       2639
#define COG2FIS1_FIS11                2640
#define G2FIS11                       2641
#define COG2FIS1_FIS12                2642
#define G2FIS12                       2643
#define COG2FIS1_FIS13                2644
#define G2FIS13                       2645
#define COG2FIS1_FIS14                2646
#define G2FIS14                       2647
#define COG2FIS1_FIS15                2648
#define G2FIS15                       2649
#define COG2FSIM0                     2650
#define COG2FSIM0_FSIM0               2651
#define G2FSIM0                       2652
#define COG2FSIM0_FSIM1               2653
#define G2FSIM1                       2654
#define COG2FSIM0_FSIM2               2655
#define G2FSIM2                       2656
#define COG2FSIM0_FSIM3               2657
#define G2FSIM3                       2658
#define G2FSIM4                       2659
#define COG2FSIM0_FSIM4               2660
#define G2FSIM5                       2661
#define COG2FSIM0_FSIM5               2662
#define COG2FSIM0_FSIM6               2663
#define G2FSIM6                       2664
#define G2FSIM7                       2665
#define COG2FSIM0_FSIM7               2666
#define COG2FSIM1                     2667
#define G2FSIM8                       2668
#define COG2FSIM1_FSIM8               2669
#define G2FSIM9                       2670
#define COG2FSIM1_FSIM9               2671
#define G2FSIM10                      2672
#define COG2FSIM1_FSIM10              2673
#define G2FSIM11                      2674
#define COG2FSIM1_FSIM11              2675
#define G2FSIM12                      2676
#define COG2FSIM1_FSIM12              2677
#define G2FSIM13                      2678
#define COG2FSIM1_FSIM13              2679
#define G2FSIM14                      2680
#define COG2FSIM1_FSIM14              2681
#define G2FSIM15                      2682
#define COG2FSIM1_FSIM15              2683
#define COG2ASD0                      2684
#define COG2ASD0_ASDAC0               2685
#define G2ASDAC                       2686
#define COG2ASD0_ASDAC                2687
#define G2ASDAC0                      2688
#define COG2ASD0_ASDAC1               2689
#define G2ASDAC1                      2690
#define COG2ASD0_ASDBD                2691
#define G2ASDBD0                      2692
#define COG2ASD0_ASDBD0               2693
#define G2ASDBD                       2694
#define G2ASDBD1                      2695
#define COG2ASD0_ASDBD1               2696
#define G2ARSEN                       2697
#define COG2ASD0_ARSEN                2698
#define COG2ASD0_ASREN                2699
#define G2ASREN                       2700
#define COG2ASD0_ASE                  2701
#define G2ASE                         2702
#define COG2ASD1                      2703
#define COG2ASD1_AS0E                 2704
#define G2AS0E                        2705
#define G2AS1E                        2706
#define COG2ASD1_AS1E                 2707
#define COG2ASD1_AS2E                 2708
#define G2AS2E                        2709
#define G2AS3E                        2710
#define COG2ASD1_AS3E                 2711
#define COG2ASD1_AS4E                 2712
#define G2AS4E                        2713
#define COG2ASD1_AS5E                 2714
#define G2AS5E                        2715
#define G2AS6E                        2716
#define COG2ASD1_AS6E                 2717
#define COG2ASD1_AS7E                 2718
#define G2AS7E                        2719
#define COG2STR                       2720
#define COG2STR_STRA                  2721
#define G2STRA                        2722
#define COG2STR_STRB                  2723
#define G2STRB                        2724
#define COG2STR_STRC                  2725
#define G2STRC                        2726
#define COG2STR_STRD                  2727
#define G2STRD                        2728
#define COG2STR_SDATA                 2729
#define G2SDATA                       2730
#define COG2STR_SDATB                 2731
#define G2SDATB                       2732
#define COG2STR_SDATC                 2733
#define G2SDATC                       2734
#define COG2STR_SDATD                 2735
#define G2SDATD                       2736
#define PRG1RTSS                      2737
#define RG1RTSS0                      2738
#define PRG1RTSS_RTSS                 2739
#define PRG1RTSS_RTSS0                2740
#define RG1RTSS1                      2741
#define PRG1RTSS_RTSS1                2742
#define RG1RTSS2                      2743
#define PRG1RTSS_RTSS2                2744
#define RG1RTSS3                      2745
#define PRG1RTSS_RTSS3                2746
#define PRG1FTSS                      2747
#define RG1FTSS0                      2748
#define PRG1FTSS_FTSS                 2749
#define PRG1FTSS_FTSS0                2750
#define RG1FTSS1                      2751
#define PRG1FTSS_FTSS1                2752
#define RG1FTSS2                      2753
#define PRG1FTSS_FTSS2                2754
#define RG1FTSS3                      2755
#define PRG1FTSS_FTSS3                2756
#define PRG1INS                       2757
#define PRG1INS_INS                   2758
#define PRG1INS_INS0                  2759
#define RG1INS0                       2760
#define PRG1INS_INS1                  2761
#define RG1INS1                       2762
#define PRG1INS_INS2                  2763
#define RG1INS2                       2764
