tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1776_tdd.h
#define PRG1INS_INS3                  2765
#define RG1INS3                       2766
#define PRG1CON0                      2767
#define PRG1CON0_GO                   2768
#define RG1GO                         2769
#define RG1OS                         2770
#define PRG1CON0_OS                   2771
#define RG1MODE0                      2772
#define RG1MODE                       2773
#define PRG1CON0_MODE                 2774
#define PRG1CON0_MODE0                2775
#define RG1MODE1                      2776
#define PRG1CON0_MODE1                2777
#define PRG1CON0_REDG                 2778
#define RG1REDG                       2779
#define RG1FEDG                       2780
#define PRG1CON0_FEDG                 2781
#define PRG1CON0_EN                   2782
#define RG1EN                         2783
#define PRG1CON1                      2784
#define PRG1CON1_RPOL                 2785
#define RG1RPOL                       2786
#define PRG1CON1_FPOL                 2787
#define RG1FPOL                       2788
#define PRG1CON1_RDY                  2789
#define RG1RDY                        2790
#define PRG1CON2                      2791
#define RG1ISET0                      2792
#define PRG1CON2_ISET                 2793
#define RG1ISET                       2794
#define PRG1CON2_ISET0                2795
#define RG1ISET1                      2796
#define PRG1CON2_ISET1                2797
#define RG1ISET2                      2798
#define PRG1CON2_ISET2                2799
#define RG1ISET3                      2800
#define PRG1CON2_ISET3                2801
#define RG1ISET4                      2802
#define PRG1CON2_ISET4                2803
#define PRG2RTSS                      2804
#define PRG2RTSS_RTSS                 2805
#define RG2RTSS0                      2806
#define PRG2RTSS_RTSS0                2807
#define RG2RTSS1                      2808
#define PRG2RTSS_RTSS1                2809
#define RG2RTSS2                      2810
#define PRG2RTSS_RTSS2                2811
#define RG2RTSS3                      2812
#define PRG2RTSS_RTSS3                2813
#define PRG2FTSS                      2814
#define RG2FTSS0                      2815
#define PRG2FTSS_FTSS                 2816
#define PRG2FTSS_FTSS0                2817
#define RG2FTSS1                      2818
#define PRG2FTSS_FTSS1                2819
#define PRG2FTSS_FTSS2                2820
#define RG2FTSS2                      2821
#define RG2FTSS3                      2822
#define PRG2FTSS_FTSS3                2823
#define PRG2INS                       2824
#define PRG2INS_INS                   2825
#define PRG2INS_INS0                  2826
#define RG2INS0                       2827
#define PRG2INS_INS1                  2828
#define RG2INS1                       2829
#define PRG2INS_INS2                  2830
#define RG2INS2                       2831
#define PRG2INS_INS3                  2832
#define RG2INS3                       2833
#define PRG2CON0                      2834
#define PRG2CON0_GO                   2835
#define RG2GO                         2836
#define PRG2CON0_OS                   2837
#define RG2OS                         2838
#define RG2MODE0                      2839
#define PRG2CON0_MODE0                2840
#define RG2MODE                       2841
#define PRG2CON0_MODE                 2842
#define RG2MODE1                      2843
#define PRG2CON0_MODE1                2844
#define PRG2CON0_REDG                 2845
#define RG2REDG                       2846
#define RG2FEDG                       2847
#define PRG2CON0_FEDG                 2848
#define PRG2CON0_EN                   2849
#define RG2EN                         2850
#define PRG2CON1                      2851
#define PRG2CON1_RPOL                 2852
#define RG2RPOL                       2853
#define PRG2CON1_FPOL                 2854
#define RG2FPOL                       2855
#define PRG2CON1_RDY                  2856
#define RG2RDY                        2857
#define PRG2CON2                      2858
#define PRG2CON2_ISET                 2859
#define RG2ISET0                      2860
#define PRG2CON2_ISET0                2861
#define RG2ISET                       2862
#define RG2ISET1                      2863
#define PRG2CON2_ISET1                2864
#define RG2ISET2                      2865
#define PRG2CON2_ISET2                2866
#define RG2ISET3                      2867
#define PRG2CON2_ISET3                2868
#define PRG2CON2_ISET4                2869
#define RG2ISET4                      2870
#define PRG3RTSS                      2871
#define PRG3RTSS_RTSS0                2872
#define PRG3RTSS_RTSS                 2873
#define RG3RTSS0                      2874
#define PRG3RTSS_RTSS1                2875
#define RG3RTSS1                      2876
#define PRG3RTSS_RTSS2                2877
#define RG3RTSS2                      2878
#define PRG3RTSS_RTSS3                2879
#define RG3RTSS3                      2880
#define PRG3FTSS                      2881
#define PRG3FTSS_FTSS0                2882
#define RG3FTSS0                      2883
#define PRG3FTSS_FTSS                 2884
#define RG3FTSS1                      2885
#define PRG3FTSS_FTSS1                2886
#define RG3FTSS2                      2887
#define PRG3FTSS_FTSS2                2888
#define RG3FTSS3                      2889
#define PRG3FTSS_FTSS3                2890
#define PRG3INS                       2891
#define RG3INS0                       2892
#define PRG3INS_INS0                  2893
#define PRG3INS_INS                   2894
#define RG3INS1                       2895
#define PRG3INS_INS1                  2896
#define PRG3INS_INS2                  2897
#define RG3INS2                       2898
#define RG3INS3                       2899
#define PRG3INS_INS3                  2900
#define PRG3CON0                      2901
#define PRG3CON0_GO                   2902
#define RG3GO                         2903
#define RG3OS                         2904
#define PRG3CON0_OS                   2905
#define PRG3CON0_MODE                 2906
#define RG3MODE                       2907
#define PRG3CON0_MODE0                2908
#define RG3MODE0                      2909
#define PRG3CON0_MODE1                2910
#define RG3MODE1                      2911
#define PRG3CON0_REDG                 2912
#define RG3REDG                       2913
#define PRG3CON0_FEDG                 2914
#define RG3FEDG                       2915
#define PRG3CON0_EN                   2916
#define RG3EN                         2917
#define PRG3CON1                      2918
#define PRG3CON1_RPOL                 2919
#define RG3RPOL                       2920
#define RG3FPOL                       2921
#define PRG3CON1_FPOL                 2922
#define PRG3CON1_RDY                  2923
#define RG3RDY                        2924
#define PRG3CON2                      2925
#define PRG3CON2_ISET                 2926
#define RG3ISET                       2927
#define RG3ISET0                      2928
#define PRG3CON2_ISET0                2929
#define PRG3CON2_ISET1                2930
#define RG3ISET1                      2931
#define RG3ISET2                      2932
#define PRG3CON2_ISET2                2933
#define RG3ISET3                      2934
#define PRG3CON2_ISET3                2935
#define PRG3CON2_ISET4                2936
#define RG3ISET4                      2937
#define COG3PHR                       2938
#define COG3PHR_PHR0                  2939
#define G3PHR0                        2940
#define COG3PHR_PHR                   2941
#define G3PHR1                        2942
#define COG3PHR_PHR1                  2943
#define COG3PHR_PHR2                  2944
#define G3PHR2                        2945
#define COG3PHR_PHR3                  2946
#define G3PHR3                        2947
#define COG3PHR_PHR4                  2948
#define G3PHR4                        2949
#define G3PHR5                        2950
#define COG3PHR_PHR5                  2951
#define COG3PHF                       2952
#define COG3PHF_PHF                   2953
#define G3PHF0                        2954
#define COG3PHF_PHF0                  2955
#define COG3PHF_PHF1                  2956
#define G3PHF1                        2957
#define COG3PHF_PHF2                  2958
#define G3PHF2                        2959
#define COG3PHF_PHF3                  2960
#define G3PHF3                        2961
#define COG3PHF_PHF4                  2962
#define G3PHF4                        2963
#define COG3PHF_PHF5                  2964
#define G3PHF5                        2965
#define COG3BLKR                      2966
#define COG3BLKR_BLKR0                2967
#define G3BLKR0                       2968
#define COG3BLKR_BLKR                 2969
#define COG3BLKR_BLKR1                2970
#define G3BLKR1                       2971
#define COG3BLKR_BLKR2                2972
#define G3BLKR2                       2973
#define COG3BLKR_BLKR3                2974
#define G3BLKR3                       2975
#define COG3BLKR_BLKR4                2976
#define G3BLKR4                       2977
#define COG3BLKR_BLKR5                2978
#define G3BLKR5                       2979
#define COG3BLKF                      2980
#define G3BLKF0                       2981
#define COG3BLKF_BLKF                 2982
#define COG3BLKF_BLKF0                2983
#define G3BLKF1                       2984
#define COG3BLKF_BLKF1                2985
#define G3BLKF2                       2986
#define COG3BLKF_BLKF2                2987
#define G3BLKF3                       2988
#define COG3BLKF_BLKF3                2989
#define G3BLKF4                       2990
#define COG3BLKF_BLKF4                2991
#define G3BLKF5                       2992
#define COG3BLKF_BLKF5                2993
#define COG3DBR                       2994
#define G3DBR0                        2995
#define COG3DBR_DBR0                  2996
#define COG3DBR_DBR                   2997
#define G3DBR1                        2998
#define COG3DBR_DBR1                  2999
#define G3DBR2                        3000
#define COG3DBR_DBR2                  3001
#define G3DBR3                        3002
#define COG3DBR_DBR3                  3003
#define G3DBR4                        3004
#define COG3DBR_DBR4                  3005
#define G3DBR5                        3006
#define COG3DBR_DBR5                  3007
#define COG3DBF                       3008
#define G3DBF                         3009
#define G3DBF0                        3010
#define COG3DBF_DBF0                  3011
#define G3DBF1                        3012
#define COG3DBF_DBF1                  3013
#define G3DBF2                        3014
#define COG3DBF_DBF2                  3015
#define G3DBF3                        3016
#define COG3DBF_DBF3                  3017
#define G3DBF4                        3018
#define COG3DBF_DBF4                  3019
#define G3DBF5                        3020
#define COG3DBF_DBF5                  3021
#define COG3CON0                      3022
#define G3MD                          3023
#define COG3CON0_MD                   3024
#define G3MD0                         3025
#define COG3CON0_MD0                  3026
#define G3MD1                         3027
#define COG3CON0_MD1                  3028
#define COG3CON0_MD2                  3029
#define G3MD2                         3030
#define G3CS                          3031
#define COG3CON0_CS0                  3032
#define G3CS0                         3033
#define COG3CON0_CS                   3034
#define COG3CON0_CS1                  3035
#define G3CS1                         3036
#define COG3CON0_LD                   3037
#define G3LD                          3038
#define G3EN                          3039
#define COG3CON0_EN                   3040
#define COG3CON1                      3041
#define G3POLA                        3042
#define COG3CON1_POLA                 3043
#define G3POLB                        3044
#define COG3CON1_POLB                 3045
#define G3POLC                        3046
#define COG3CON1_POLC                 3047
#define COG3CON1_POLD                 3048
#define G3POLD                        3049
#define G3FDBS                        3050
#define COG3CON1_FDBS                 3051
#define COG3CON1_RDBS                 3052
#define G3RDBS                        3053
#define COG3RIS0                      3054
#define G3RIS0                        3055
#define COG3RIS0_RIS0                 3056
#define G3RIS1                        3057
#define COG3RIS0_RIS1                 3058
#define G3RIS2                        3059
#define COG3RIS0_RIS2                 3060
#define G3RIS3                        3061
#define COG3RIS0_RIS3                 3062
#define G3RIS4                        3063
#define COG3RIS0_RIS4                 3064
#define G3RIS5                        3065
#define COG3RIS0_RIS5                 3066
#define G3RIS6                        3067
#define COG3RIS0_RIS6                 3068
#define G3RIS7                        3069
#define COG3RIS0_RIS7                 3070
#define COG3RIS1                      3071
#define G3RIS9                        3072
#define COG3RIS1_RIS9                 3073
#define G3RIS11                       3074
#define COG3RIS1_RIS11                3075
#define G3RIS12                       3076
#define COG3RIS1_RIS12                3077
#define G3RIS13                       3078
#define COG3RIS1_RIS13                3079
#define G3RIS14                       3080
#define COG3RIS1_RIS14                3081
#define G3RIS15                       3082
#define COG3RIS1_RIS15                3083
#define COG3RSIM0                     3084
#define G3RSIM0                       3085
#define COG3RSIM0_RSIM0               3086
#define G3RSIM1                       3087
#define COG3RSIM0_RSIM1               3088
#define G3RSIM2                       3089
#define COG3RSIM0_RSIM2               3090
#define G3RSIM3                       3091
#define COG3RSIM0_RSIM3               3092
#define G3RSIM4                       3093
#define COG3RSIM0_RSIM4               3094
#define G3RSIM5                       3095
#define COG3RSIM0_RSIM5               3096
#define G3RSIM6                       3097
#define COG3RSIM0_RSIM6               3098
#define G3RSIM7                       3099
#define COG3RSIM0_RSIM7               3100
#define COG3RSIM1                     3101
#define G3RSIM9                       3102
#define COG3RSIM1_RSIM9               3103
#define G3RSIM11                      3104
#define COG3RSIM1_RSIM11              3105
#define G3RSIM12                      3106
#define COG3RSIM1_RSIM12              3107
#define G3RSIM13                      3108
#define COG3RSIM1_RSIM13              3109
#define G3RSIM14                      3110
#define COG3RSIM1_RSIM14              3111
#define G3RSIM15                      3112
#define COG3RSIM1_RSIM15              3113
#define COG3FIS0                      3114
#define COG3FIS0_FIS0                 3115
#define G3FIS0                        3116
#define COG3FIS0_FIS1                 3117
#define G3FIS1                        3118
#define COG3FIS0_FIS2                 3119
#define G3FIS2                        3120
#define COG3FIS0_FIS3                 3121
#define G3FIS3                        3122
#define COG3FIS0_FIS4                 3123
#define G3FIS4                        3124
#define COG3FIS0_FIS5                 3125
#define G3FIS5                        3126
#define COG3FIS0_FIS6                 3127
#define G3FIS6                        3128
#define G3FIS7                        3129
#define COG3FIS0_FIS7                 3130
#define COG3FIS1                      3131
#define G3FIS9                        3132
#define COG3FIS1_FIS9                 3133
#define COG3FIS1_FIS11                3134
#define G3FIS11                       3135
#define G3FIS12                       3136
#define COG3FIS1_FIS12                3137
#define G3FIS13                       3138
#define COG3FIS1_FIS13                3139
#define G3FIS14                       3140
#define COG3FIS1_FIS14                3141
#define G3FIS15                       3142
#define COG3FIS1_FIS15                3143
#define COG3FSIM0                     3144
#define COG3FSIM0_FSIM0               3145
#define G3FSIM0                       3146
#define G3FSIM1                       3147
#define COG3FSIM0_FSIM1               3148
#define COG3FSIM0_FSIM2               3149
#define G3FSIM2                       3150
#define COG3FSIM0_FSIM3               3151
#define G3FSIM3                       3152
#define G3FSIM4                       3153
#define COG3FSIM0_FSIM4               3154
#define COG3FSIM0_FSIM5               3155
#define G3FSIM5                       3156
#define COG3FSIM0_FSIM6               3157
#define G3FSIM6                       3158
#define COG3FSIM0_FSIM7               3159
#define G3FSIM7                       3160
#define COG3FSIM1                     3161
#define COG3FSIM1_FSIM9               3162
#define G3FSIM9                       3163
#define COG3FSIM1_FSIM11              3164
#define G3FSIM11                      3165
#define G3FSIM12                      3166
#define COG3FSIM1_FSIM12              3167
#define COG3FSIM1_FSIM13              3168
#define G3FSIM13                      3169
#define G3FSIM14                      3170
#define COG3FSIM1_FSIM14              3171
#define G3FSIM15                      3172
#define COG3FSIM1_FSIM15              3173
#define COG3ASD0                      3174
#define COG3ASD0_ASDAC0               3175
#define G3ASDAC                       3176
#define G3ASDAC0                      3177
#define COG3ASD0_ASDAC                3178
#define COG3ASD0_ASDAC1               3179
#define G3ASDAC1                      3180
#define G3ASDBD                       3181
#define COG3ASD0_ASDBD                3182
#define G3ASDBD0                      3183
#define COG3ASD0_ASDBD0               3184
#define COG3ASD0_ASDBD1               3185
#define G3ASDBD1                      3186
#define COG3ASD0_ASREN                3187
#define COG3ASD0_ARSEN                3188
#define G3ASREN                       3189
#define G3ARSEN                       3190
#define COG3ASD0_ASE                  3191
#define G3ASE                         3192
#define COG3ASD1                      3193
#define G3AS0E                        3194
#define COG3ASD1_AS0E                 3195
#define G3AS1E                        3196
#define COG3ASD1_AS1E                 3197
#define COG3ASD1_AS2E                 3198
#define G3AS2E                        3199
#define G3AS3E                        3200
#define COG3ASD1_AS3E                 3201
#define G3AS4E                        3202
#define COG3ASD1_AS4E                 3203
#define G3AS5E                        3204
#define COG3ASD1_AS5E                 3205
#define G3AS6E                        3206
#define COG3ASD1_AS6E                 3207
#define COG3ASD1_AS7E                 3208
#define G3AS7E                        3209
#define COG3STR                       3210
#define COG3STR_STRA                  3211
#define G3STRA                        3212
#define COG3STR_STRB                  3213
#define G3STRB                        3214
#define COG3STR_STRC                  3215
#define G3STRC                        3216
#define COG3STR_STRD                  3217
#define G3STRD                        3218
#define COG3STR_SDATA                 3219
#define G3SDATA                       3220
#define COG3STR_SDATB                 3221
#define G3SDATB                       3222
#define COG3STR_SDATC                 3223
#define G3SDATC                       3224
#define COG3STR_SDATD                 3225
#define G3SDATD                       3226
#define CM4CON0                       3227
#define CM4CON0_SYNC                  3228
#define C4SYNC                        3229
#define C4HYS                         3230
#define CM4CON0_HYS                   3231
#define C4SP                          3232
#define C4ZLF                         3233
#define CM4CON0_ZLF                   3234
#define C4POL                         3235
#define CM4CON0_POL                   3236
#define C4OUT                         3237
#define CM4CON0_OUT                   3238
#define C4ON                          3239
#define CM4CON0_ON                    3240
#define CM4CON1                       3241
#define C4INTN                        3242
#define CM4CON1_INTN                  3243
#define CM4CON1_INTP                  3244
#define C4INTP                        3245
#define CM4NSEL                       3246
#define CM4NSEL_NCH                   3247
#define C4NCH0                        3248
#define C4NCH                         3249
#define C4NCH1                        3250
#define C4NCH2                        3251
#define C4NCH3                        3252
#define CM4PSEL                       3253
#define CM4PSEL_PCH0                  3254
#define C4PCH0                        3255
#define C4PCH                         3256
#define CM4PSEL_PCH                   3257
#define CM4PSEL_PCH1                  3258
#define C4PCH1                        3259
#define CM4PSEL_PCH2                  3260
#define C4PCH2                        3261
#define CM4PSEL_PCH3                  3262
#define C4PCH3                        3263
#define CM5CON0                       3264
#define CM5CON0_SYNC                  3265
#define C5SYNC                        3266
#define C5HYS                         3267
#define CM5CON0_HYS                   3268
#define C5SP                          3269
#define CM5CON0_ZLF                   3270
#define C5ZLF                         3271
#define C5POL                         3272
#define CM5CON0_POL                   3273
#define CM5CON0_OUT                   3274
#define C5OUT                         3275
#define CM5CON0_ON                    3276
#define C5ON                          3277
#define CM5CON1                       3278
#define CM5CON1_INTN                  3279
#define C5INTN                        3280
#define CM5CON1_INTP                  3281
#define C5INTP                        3282
#define CM5NSEL                       3283
#define C5NCH                         3284
#define CM5NSEL_NCH                   3285
#define C5NCH0                        3286
#define C5NCH1                        3287
#define C5NCH2                        3288
#define C5NCH3                        3289
#define CM5PSEL                       3290
#define C5PCH                         3291
#define CM5PSEL_PCH                   3292
#define C5PCH0                        3293
#define CM5PSEL_PCH0                  3294
#define C5PCH1                        3295
#define CM5PSEL_PCH1                  3296
#define C5PCH2                        3297
#define CM5PSEL_PCH2                  3298
#define C5PCH3                        3299
#define CM5PSEL_PCH3                  3300
#define CM6CON0                       3301
#define C6SYNC                        3302
#define CM6CON0_SYNC                  3303
#define C6HYS                         3304
#define CM6CON0_HYS                   3305
#define C6SP                          3306
#define CM6CON0_ZLF                   3307
#define C6ZLF                         3308
#define CM6CON0_POL                   3309
#define C6POL                         3310
#define C6OUT                         3311
#define CM6CON0_OUT                   3312
#define CM6CON0_ON                    3313
#define C6ON                          3314
#define CM6CON1                       3315
#define C6INTN                        3316
#define CM6CON1_INTN                  3317
#define CM6CON1_INTP                  3318
#define C6INTP                        3319
#define CM6NSEL                       3320
#define C6NCH                         3321
#define C6NCH0                        3322
