tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1776_tdd.h
#define CM6NSEL_NCH                   3323
#define C6NCH1                        3324
#define C6NCH2                        3325
#define C6NCH3                        3326
#define CM6PSEL                       3327
#define C6PCH                         3328
#define CM6PSEL_PCH0                  3329
#define CM6PSEL_PCH                   3330
#define C6PCH0                        3331
#define CM6PSEL_PCH1                  3332
#define C6PCH1                        3333
#define CM6PSEL_PCH2                  3334
#define C6PCH2                        3335
#define C6PCH3                        3336
#define CM6PSEL_PCH3                  3337
#define PWMEN                         3338
#define MPWM5EN                       3339
#define MPWM6EN                       3340
#define MPWM11EN                      3341
#define PWMLD                         3342
#define MPWM5LD                       3343
#define MPWM6LD                       3344
#define MPWM11LD                      3345
#define PWMOUT                        3346
#define MPWM5OUT                      3347
#define MPWM6OUT                      3348
#define MPWM11OUT                     3349
#define PWM5PHL0                      3350
#define PWM5PHL_PH                    3351
#define PWM5PHL                       3352
#define PWM5PHL1                      3353
#define PWM5PHL2                      3354
#define PWM5PHL3                      3355
#define PWM5PHL4                      3356
#define PWM5PHL5                      3357
#define PWM5PHL6                      3358
#define PWM5PHL7                      3359
#define PWM5PHH0                      3360
#define PWM5PHH_PH                    3361
#define PWM5PHH                       3362
#define PWM5PHH1                      3363
#define PWM5PHH2                      3364
#define PWM5PHH3                      3365
#define PWM5PHH4                      3366
#define PWM5PHH5                      3367
#define PWM5PHH6                      3368
#define PWM5PHH7                      3369
#define PWM5DCL_DC                    3370
#define PWM5DCL                       3371
#define PWM5DCL0                      3372
#define PWM5DCL1                      3373
#define PWM5DCL2                      3374
#define PWM5DCL3                      3375
#define PWM5DCL4                      3376
#define PWM5DCL5                      3377
#define PWM5DCL6                      3378
#define PWM5DCL7                      3379
#define PWM5DCH_DC                    3380
#define PWM5DCH                       3381
#define PWM5DCH0                      3382
#define PWM5DCH1                      3383
#define PWM5DCH2                      3384
#define PWM5DCH3                      3385
#define PWM5DCH4                      3386
#define PWM5DCH5                      3387
#define PWM5DCH6                      3388
#define PWM5DCH7                      3389
#define PWM5PRL0                      3390
#define PWM5PRL_PR                    3391
#define PWM5PRL                       3392
#define PWM5PRL1                      3393
#define PWM5PRL2                      3394
#define PWM5PRL3                      3395
#define PWM5PRL4                      3396
#define PWM5PRL5                      3397
#define PWM5PRL6                      3398
#define PWM5PRL7                      3399
#define PWM5PRH_PR                    3400
#define PWM5PRH0                      3401
#define PWM5PRH                       3402
#define PWM5PRH1                      3403
#define PWM5PRH2                      3404
#define PWM5PRH3                      3405
#define PWM5PRH4                      3406
#define PWM5PRH5                      3407
#define PWM5PRH6                      3408
#define PWM5PRH7                      3409
#define PWM5OFL                       3410
#define PWM5OFL0                      3411
#define PWM5OFL_OF                    3412
#define PWM5OFL1                      3413
#define PWM5OFL2                      3414
#define PWM5OFL3                      3415
#define PWM5OFL4                      3416
#define PWM5OFL5                      3417
#define PWM5OFL6                      3418
#define PWM5OFL7                      3419
#define PWM5OFH_OF                    3420
#define PWM5OFH                       3421
#define PWM5OFH0                      3422
#define PWM5OFH1                      3423
#define PWM5OFH2                      3424
#define PWM5OFH3                      3425
#define PWM5OFH4                      3426
#define PWM5OFH5                      3427
#define PWM5OFH6                      3428
#define PWM5OFH7                      3429
#define PWM5TMRL_TMR                  3430
#define PWM5TMRL                      3431
#define PWM5TMRL0                     3432
#define PWM5TMRL1                     3433
#define PWM5TMRL2                     3434
#define PWM5TMRL3                     3435
#define PWM5TMRL4                     3436
#define PWM5TMRL5                     3437
#define PWM5TMRL6                     3438
#define PWM5TMRL7                     3439
#define PWM5TMRH0                     3440
#define PWM5TMRH                      3441
#define PWM5TMRH_TMR                  3442
#define PWM5TMRH1                     3443
#define PWM5TMRH2                     3444
#define PWM5TMRH3                     3445
#define PWM5TMRH4                     3446
#define PWM5TMRH5                     3447
#define PWM5TMRH6                     3448
#define PWM5TMRH7                     3449
#define PWM5CON                       3450
#define PWM5MODE0                     3451
#define PWM5CON_MODE                  3452
#define PWM5MODE                      3453
#define PWM5CON_MODE0                 3454
#define PWM5MODE1                     3455
#define PWM5CON_MODE1                 3456
#define PWM5POL                       3457
#define PWM5CON_POL                   3458
#define PWM5OUT                       3459
#define PWM5CON_OUT                   3460
#define PWM5EN                        3461
#define PWM5CON_EN                    3462
#define PWM5INTE                      3463
#define PWM5INTE_PRIE                 3464
#define PWM5PRIE                      3465
#define PWM5INTE_DCIE                 3466
#define PWM5DCIE                      3467
#define PWM5INTE_PHIE                 3468
#define PWM5PHIE                      3469
#define PWM5OFIE                      3470
#define PWM5INTE_OFIE                 3471
#define PWM5INTF                      3472
#define PWM5INTF_PRIF                 3473
#define PWM5PRIF                      3474
#define PWM5INTF_DCIF                 3475
#define PWM5DCIF                      3476
#define PWM5INTF_PHIF                 3477
#define PWM5PHIF                      3478
#define PWM5OFIF                      3479
#define PWM5INTF_OFIF                 3480
#define PWM5CLKCON                    3481
#define PWM5CS0                       3482
#define PWM5CLKCON_CS0                3483
#define PWM5CS                        3484
#define PWM5CLKCON_CS                 3485
#define PWM5CS1                       3486
#define PWM5CLKCON_CS1                3487
#define PWM5CS2                       3488
#define PWM5CLKCON_CS2                3489
#define PWM5PS                        3490
#define PWM5CLKCON_PS0                3491
#define PWM5PS0                       3492
#define PWM5CLKCON_PS                 3493
#define PWM5CLKCON_PS1                3494
#define PWM5PS1                       3495
#define PWM5CLKCON_PS2                3496
#define PWM5PS2                       3497
#define PWM5LDCON                     3498
#define PWM5LDCON_LDS                 3499
#define PWM5LDCON_LDS0                3500
#define PWM5LDS                       3501
#define PWM5LDS0                      3502
#define PWM5LDCON_LDS1                3503
#define PWM5LDS1                      3504
#define PWM5LDCON_LDT                 3505
#define PWM5LDM                       3506
#define PWM5LDCON_LDA                 3507
#define PWM5LD                        3508
#define PWM5OFCON                     3509
#define PWM5OFCON_OFS0                3510
#define PWM5OFCON_OFS                 3511
#define PWM5OFS0                      3512
#define PWM5OFS                       3513
#define PWM5OFCON_OFS1                3514
#define PWM5OFS1                      3515
#define PWM5OFCON_OFO                 3516
#define PWM5OFMC                      3517
#define PWM5OFM                       3518
#define PWM5OFM0                      3519
#define PWM5OFCON_OFM                 3520
#define PWM5OFCON_OFM0                3521
#define PWM5OFM1                      3522
#define PWM5OFCON_OFM1                3523
#define PWM6PHL                       3524
#define PWM6PHL_PH                    3525
#define PWM6PHL0                      3526
#define PWM6PHL1                      3527
#define PWM6PHL2                      3528
#define PWM6PHL3                      3529
#define PWM6PHL4                      3530
#define PWM6PHL5                      3531
#define PWM6PHL6                      3532
#define PWM6PHL7                      3533
#define PWM6PHH0                      3534
#define PWM6PHH                       3535
#define PWM6PHH_PH                    3536
#define PWM6PHH1                      3537
#define PWM6PHH2                      3538
#define PWM6PHH3                      3539
#define PWM6PHH4                      3540
#define PWM6PHH5                      3541
#define PWM6PHH6                      3542
#define PWM6PHH7                      3543
#define PWM6DCL                       3544
#define PWM6DCL_DC                    3545
#define PWM6DCL0                      3546
#define PWM6DCL1                      3547
#define PWM6DCL2                      3548
#define PWM6DCL3                      3549
#define PWM6DCL4                      3550
#define PWM6DCL5                      3551
#define PWM6DCL6                      3552
#define PWM6DCL7                      3553
#define PWM6DCH                       3554
#define PWM6DCH0                      3555
#define PWM6DCH_DC                    3556
#define PWM6DCH1                      3557
#define PWM6DCH2                      3558
#define PWM6DCH3                      3559
#define PWM6DCH4                      3560
#define PWM6DCH5                      3561
#define PWM6DCH6                      3562
#define PWM6DCH7                      3563
#define PWM6PRL0                      3564
#define PWM6PRL                       3565
#define PWM6PRL_PR                    3566
#define PWM6PRL1                      3567
#define PWM6PRL2                      3568
#define PWM6PRL3                      3569
#define PWM6PRL4                      3570
#define PWM6PRL5                      3571
#define PWM6PRL6                      3572
#define PWM6PRL7                      3573
#define PWM6PRH_PR                    3574
#define PWM6PRH                       3575
#define PWM6PRH0                      3576
#define PWM6PRH1                      3577
#define PWM6PRH2                      3578
#define PWM6PRH3                      3579
#define PWM6PRH4                      3580
#define PWM6PRH5                      3581
#define PWM6PRH6                      3582
#define PWM6PRH7                      3583
#define PWM6OFL                       3584
#define PWM6OFL0                      3585
#define PWM6OFL_OF                    3586
#define PWM6OFL1                      3587
#define PWM6OFL2                      3588
#define PWM6OFL3                      3589
#define PWM6OFL4                      3590
#define PWM6OFL5                      3591
#define PWM6OFL6                      3592
#define PWM6OFL7                      3593
#define PWM6OFH                       3594
#define PWM6OFH_OF                    3595
#define PWM6OFH0                      3596
#define PWM6OFH1                      3597
#define PWM6OFH2                      3598
#define PWM6OFH3                      3599
#define PWM6OFH4                      3600
#define PWM6OFH5                      3601
#define PWM6OFH6                      3602
#define PWM6OFH7                      3603
#define PWM6TMRL_TMR                  3604
#define PWM6TMRL                      3605
#define PWM6TMRL0                     3606
#define PWM6TMRL1                     3607
#define PWM6TMRL2                     3608
#define PWM6TMRL3                     3609
#define PWM6TMRL4                     3610
#define PWM6TMRL5                     3611
#define PWM6TMRL6                     3612
#define PWM6TMRL7                     3613
#define PWM6TMRH_TMR                  3614
#define PWM6TMRH0                     3615
#define PWM6TMRH                      3616
#define PWM6TMRH1                     3617
#define PWM6TMRH2                     3618
#define PWM6TMRH3                     3619
#define PWM6TMRH4                     3620
#define PWM6TMRH5                     3621
#define PWM6TMRH6                     3622
#define PWM6TMRH7                     3623
#define PWM6CON                       3624
#define PWM6CON_MODE0                 3625
#define PWM6CON_MODE                  3626
#define PWM6MODE                      3627
#define PWM6MODE0                     3628
#define PWM6CON_MODE1                 3629
#define PWM6MODE1                     3630
#define PWM6POL                       3631
#define PWM6CON_POL                   3632
#define PWM6OUT                       3633
#define PWM6CON_OUT                   3634
#define PWM6EN                        3635
#define PWM6CON_EN                    3636
#define PWM6INTE                      3637
#define PWM6PRIE                      3638
#define PWM6INTE_PRIE                 3639
#define PWM6DCIE                      3640
#define PWM6INTE_DCIE                 3641
#define PWM6PHIE                      3642
#define PWM6INTE_PHIE                 3643
#define PWM6INTE_OFIE                 3644
#define PWM6OFIE                      3645
#define PWM6INTF                      3646
#define PWM6INTF_PRIF                 3647
#define PWM6PRIF                      3648
#define PWM6INTF_DCIF                 3649
#define PWM6DCIF                      3650
#define PWM6PHIF                      3651
#define PWM6INTF_PHIF                 3652
#define PWM6OFIF                      3653
#define PWM6INTF_OFIF                 3654
#define PWM6CLKCON                    3655
#define PWM6CLKCON_CS                 3656
#define PWM6CS                        3657
#define PWM6CLKCON_CS0                3658
#define PWM6CS0                       3659
#define PWM6CLKCON_CS1                3660
#define PWM6CS1                       3661
#define PWM6CLKCON_CS2                3662
#define PWM6CS2                       3663
#define PWM6PS                        3664
#define PWM6CLKCON_PS                 3665
#define PWM6PS0                       3666
#define PWM6CLKCON_PS0                3667
#define PWM6PS1                       3668
#define PWM6CLKCON_PS1                3669
#define PWM6CLKCON_PS2                3670
#define PWM6PS2                       3671
#define PWM6LDCON                     3672
#define PWM6LDS                       3673
#define PWM6LDCON_LDS                 3674
#define PWM6LDCON_LDS0                3675
#define PWM6LDS0                      3676
#define PWM6LDCON_LDS1                3677
#define PWM6LDS1                      3678
#define PWM6LDCON_LDT                 3679
#define PWM6LDM                       3680
#define PWM6LD                        3681
#define PWM6LDCON_LDA                 3682
#define PWM6OFCON                     3683
#define PWM6OFS0                      3684
#define PWM6OFCON_OFS                 3685
#define PWM6OFCON_OFS0                3686
#define PWM6OFS                       3687
#define PWM6OFS1                      3688
#define PWM6OFCON_OFS1                3689
#define PWM6OFCON_OFO                 3690
#define PWM6OFMC                      3691
#define PWM6OFM                       3692
#define PWM6OFCON_OFM                 3693
#define PWM6OFM0                      3694
#define PWM6OFCON_OFM0                3695
#define PWM6OFM1                      3696
#define PWM6OFCON_OFM1                3697
#define PWM11PHL_PH                   3698
#define PWM11PHL                      3699
#define PWM11PHL0                     3700
#define PWM11PHL1                     3701
#define PWM11PHL2                     3702
#define PWM11PHL3                     3703
#define PWM11PHL4                     3704
#define PWM11PHL5                     3705
#define PWM11PHL6                     3706
#define PWM11PHL7                     3707
#define PWM11PHH0                     3708
#define PWM11PHH                      3709
#define PWM11PHH_PH                   3710
#define PWM11PHH1                     3711
#define PWM11PHH2                     3712
#define PWM11PHH3                     3713
#define PWM11PHH4                     3714
#define PWM11PHH5                     3715
#define PWM11PHH6                     3716
#define PWM11PHH7                     3717
#define PWM11DCL_DC                   3718
#define PWM11DCL0                     3719
#define PWM11DCL                      3720
#define PWM11DCL1                     3721
#define PWM11DCL2                     3722
#define PWM11DCL3                     3723
#define PWM11DCL4                     3724
#define PWM11DCL5                     3725
#define PWM11DCL6                     3726
#define PWM11DCL7                     3727
#define PWM11DCH0                     3728
#define PWM11DCH_DC                   3729
#define PWM11DCH                      3730
#define PWM11DCH1                     3731
#define PWM11DCH2                     3732
#define PWM11DCH3                     3733
#define PWM11DCH4                     3734
#define PWM11DCH5                     3735
#define PWM11DCH6                     3736
#define PWM11DCH7                     3737
#define PWM11PRL0                     3738
#define PWM11PRL_PR                   3739
#define PWM11PRL                      3740
#define PWM11PRL1                     3741
#define PWM11PRL2                     3742
#define PWM11PRL3                     3743
#define PWM11PRL4                     3744
#define PWM11PRL5                     3745
#define PWM11PRL6                     3746
#define PWM11PRL7                     3747
#define PWM11PRH0                     3748
#define PWM11PRH_PR                   3749
#define PWM11PRH                      3750
#define PWM11PRH1                     3751
#define PWM11PRH2                     3752
#define PWM11PRH3                     3753
#define PWM11PRH4                     3754
#define PWM11PRH5                     3755
#define PWM11PRH6                     3756
#define PWM11PRH7                     3757
#define PWM11OFL_OF                   3758
#define PWM11OFL                      3759
#define PWM11OFL0                     3760
#define PWM11OFL1                     3761
#define PWM11OFL2                     3762
#define PWM11OFL3                     3763
#define PWM11OFL4                     3764
#define PWM11OFL5                     3765
#define PWM11OFL6                     3766
#define PWM11OFL7                     3767
#define PWM11OFH0                     3768
#define PWM11OFH                      3769
#define PWM11OFH_OF                   3770
#define PWM11OFH1                     3771
#define PWM11OFH2                     3772
#define PWM11OFH3                     3773
#define PWM11OFH4                     3774
#define PWM11OFH5                     3775
#define PWM11OFH6                     3776
#define PWM11OFH7                     3777
#define PWM11TMRL_TMR                 3778
#define PWM11TMRL0                    3779
#define PWM11TMRL                     3780
#define PWM11TMRL1                    3781
#define PWM11TMRL2                    3782
#define PWM11TMRL3                    3783
#define PWM11TMRL4                    3784
#define PWM11TMRL5                    3785
#define PWM11TMRL6                    3786
#define PWM11TMRL7                    3787
#define PWM11TMRH_TMR                 3788
#define PWM11TMRH                     3789
#define PWM11TMRH0                    3790
#define PWM11TMRH1                    3791
#define PWM11TMRH2                    3792
#define PWM11TMRH3                    3793
#define PWM11TMRH4                    3794
#define PWM11TMRH5                    3795
#define PWM11TMRH6                    3796
#define PWM11TMRH7                    3797
#define PWM11CON                      3798
#define PWM11MODE0                    3799
#define PWM11MODE                     3800
#define PWM11CON_MODE0                3801
#define PWM11CON_MODE                 3802
#define PWM11MODE1                    3803
#define PWM11CON_MODE1                3804
#define PWM11CON_POL                  3805
#define PWM11POL                      3806
#define PWM11CON_OUT                  3807
#define PWM11OUT                      3808
#define PWM11EN                       3809
#define PWM11CON_EN                   3810
#define PWM11INTE                     3811
#define PWM11INTE_PRIE                3812
#define PWM11PRIE                     3813
#define PWM11INTE_DCIE                3814
#define PWM11DCIE                     3815
#define PWM11INTE_PHIE                3816
#define PWM11PHIE                     3817
#define PWM11INTE_OFIE                3818
#define PWM11OFIE                     3819
#define PWM11INTF                     3820
#define PWM11INTF_PRIF                3821
#define PWM11PRIF                     3822
#define PWM11INTF_DCIF                3823
#define PWM11DCIF                     3824
#define PWM11PHIF                     3825
#define PWM11INTF_PHIF                3826
#define PWM11INTF_OFIF                3827
#define PWM11OFIF                     3828
#define PWM11CLKCON                   3829
#define PWM11CS0                      3830
#define PWM11CLKCON_CS0               3831
#define PWM11CS                       3832
#define PWM11CLKCON_CS                3833
#define PWM11CS1                      3834
#define PWM11CLKCON_CS1               3835
#define PWM11CLKCON_CS2               3836
#define PWM11CS2                      3837
#define PWM11PS0                      3838
#define PWM11PS                       3839
#define PWM11CLKCON_PS                3840
#define PWM11CLKCON_PS0               3841
#define PWM11PS1                      3842
#define PWM11CLKCON_PS1               3843
#define PWM11PS2                      3844
#define PWM11CLKCON_PS2               3845
#define PWM11LDCON                    3846
#define PWM11LDS0                     3847
#define PWM11LDCON_LDS                3848
#define PWM11LDCON_LDS0               3849
#define PWM11LDS                      3850
#define PWM11LDS1                     3851
#define PWM11LDCON_LDS1               3852
#define PWM11LDM                      3853
#define PWM11LDCON_LDT                3854
#define PWM11LD                       3855
#define PWM11LDCON_LDA                3856
#define PWM11OFCON                    3857
#define PWM11OFS0                     3858
#define PWM11OFCON_OFS0               3859
#define PWM11OFS                      3860
#define PWM11OFCON_OFS                3861
#define PWM11OFCON_OFS1               3862
#define PWM11OFS1                     3863
#define PWM11OFCON_OFO                3864
#define PWM11OFMC                     3865
#define PWM11OFCON_OFM0               3866
#define PWM11OFCON_OFM                3867
#define PWM11OFM                      3868
#define PWM11OFM0                     3869
#define PWM11OFCON_OFM1               3870
#define PWM11OFM1                     3871
#define PPSLOCK                       3872
#define PPSLOCKED                     3873
#define INTPPS                        3874
#define T0CKIPPS                      3875
#define T1CKIPPS                      3876
#define T1GPPS                        3877
#define T3CKIPPS                      3878
#define T3GPPS                        3879
#define T5CKIPPS                      3880
