tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1776_tdd.h
#define T5GPPS                        3881
#define T2INPPS                       3882
#define T4INPPS                       3883
#define T6INPPS                       3884
#define T8INPPS                       3885
#define CCP1PPS                       3886
#define CCP2PPS                       3887
#define CCP7PPS                       3888
#define COG1INPPS                     3889
#define COG2INPPS                     3890
#define COG3INPPS                     3891
#define MD1CLPPS                      3892
#define MD1CHPPS                      3893
#define MD1MODPPS                     3894
#define MD2CLPPS                      3895
#define MD2CHPPS                      3896
#define MD2MODPPS                     3897
#define MD3CLPPS                      3898
#define MD3CHPPS                      3899
#define MD3MODPPS                     3900
#define PRG1RPPS                      3901
#define PRG1FPPS                      3902
#define PRG2RPPS                      3903
#define PRG2FPPS                      3904
#define PRG3RPPS                      3905
#define PRG3FPPS                      3906
#define CLCIN0PPS                     3907
#define CLCIN1PPS                     3908
#define CLCIN2PPS                     3909
#define CLCIN3PPS                     3910
#define ADCACTPPS                     3911
#define SSPCLKPPS                     3912
#define SSPDATPPS                     3913
#define SSPSSPPS                      3914
#define RXPPS                         3915
#define CKPPS                         3916
#define RA0PPS                        3917
#define RA1PPS                        3918
#define RA2PPS                        3919
#define RA3PPS                        3920
#define RA4PPS                        3921
#define RA5PPS                        3922
#define RA6PPS                        3923
#define RA7PPS                        3924
#define RB0PPS                        3925
#define RB1PPS                        3926
#define RB2PPS                        3927
#define RB3PPS                        3928
#define RB4PPS                        3929
#define RB5PPS                        3930
#define RB6PPS                        3931
#define RB7PPS                        3932
#define RC0PPS                        3933
#define RC1PPS                        3934
#define RC2PPS                        3935
#define RC3PPS                        3936
#define RC4PPS                        3937
#define RC5PPS                        3938
#define RC6PPS                        3939
#define RC7PPS                        3940
#define CLCDATA                       3941
#define MCLC1OUT                      3942
#define MCLC2OUT                      3943
#define MCLC3OUT                      3944
#define MLC4OUT                       3945
#define CLC1CON                       3946
#define CLC1CON_MODE                  3947
#define LC1MODE0                      3948
#define LC1MODE                       3949
#define CLC1CON_MODE0                 3950
#define LC1MODE1                      3951
#define CLC1CON_MODE1                 3952
#define CLC1CON_MODE2                 3953
#define LC1MODE2                      3954
#define LC1INTN                       3955
#define CLC1CON_INTN                  3956
#define LC1INTP                       3957
#define CLC1CON_INTP                  3958
#define CLC1CON_OUT                   3959
#define LC1OUT                        3960
#define LC1EN                         3961
#define CLC1CON_EN                    3962
#define CLC1POL                       3963
#define LC1G1POL                      3964
#define CLC1POL_G1POL                 3965
#define CLC1POL_G2POL                 3966
#define LC1G2POL                      3967
#define LC1G3POL                      3968
#define CLC1POL_G3POL                 3969
#define LC1G4POL                      3970
#define CLC1POL_G4POL                 3971
#define CLC1POL_POL                   3972
#define LC1POL                        3973
#define CLC1SEL0                      3974
#define CLC1SEL0_D1S0                 3975
#define LC1D1S0                       3976
#define CLC1SEL0_D1S                  3977
#define LC1D1S                        3978
#define CLC1SEL0_D1S1                 3979
#define LC1D1S1                       3980
#define CLC1SEL0_D1S2                 3981
#define LC1D1S2                       3982
#define LC1D1S3                       3983
#define CLC1SEL0_D1S3                 3984
#define CLC1SEL0_D1S4                 3985
#define LC1D1S4                       3986
#define CLC1SEL0_D1S5                 3987
#define LC1D1S5                       3988
#define CLC1SEL1                      3989
#define CLC1SEL1_D2S0                 3990
#define CLC1SEL1_D2S                  3991
#define LC1D2S                        3992
#define LC1D2S0                       3993
#define CLC1SEL1_D2S1                 3994
#define LC1D2S1                       3995
#define CLC1SEL1_D2S2                 3996
#define LC1D2S2                       3997
#define LC1D2S3                       3998
#define CLC1SEL1_D2S3                 3999
#define LC1D2S4                       4000
#define CLC1SEL1_D2S4                 4001
#define LC1D2S5                       4002
#define CLC1SEL1_D2S5                 4003
#define CLC1SEL2                      4004
#define LC1D3S0                       4005
#define CLC1SEL2_D3S                  4006
#define LC1D3S                        4007
#define CLC1SEL2_D3S0                 4008
#define LC1D3S1                       4009
#define CLC1SEL2_D3S1                 4010
#define LC1D3S2                       4011
#define CLC1SEL2_D3S2                 4012
#define LC1D3S3                       4013
#define CLC1SEL2_D3S3                 4014
#define LC1D3S4                       4015
#define CLC1SEL2_D3S4                 4016
#define LC1D3S5                       4017
#define CLC1SEL2_D3S5                 4018
#define CLC1SEL3                      4019
#define CLC1SEL3_D4S                  4020
#define LC1D4S                        4021
#define LC1D4S0                       4022
#define CLC1SEL3_D4S0                 4023
#define CLC1SEL3_D4S1                 4024
#define LC1D4S1                       4025
#define LC1D4S2                       4026
#define CLC1SEL3_D4S2                 4027
#define LC1D4S3                       4028
#define CLC1SEL3_D4S3                 4029
#define LC1D4S4                       4030
#define CLC1SEL3_D4S4                 4031
#define LC1D4S5                       4032
#define CLC1SEL3_D4S5                 4033
#define CLC1GLS0                      4034
#define CLC1GLS0_D1N                  4035
#define LC1G1D1N                      4036
#define CLC1GLS0_D1T                  4037
#define LC1G1D1T                      4038
#define LC1G1D2N                      4039
#define CLC1GLS0_D2N                  4040
#define LC1G1D2T                      4041
#define CLC1GLS0_D2T                  4042
#define CLC1GLS0_D3N                  4043
#define LC1G1D3N                      4044
#define CLC1GLS0_D3T                  4045
#define LC1G1D3T                      4046
#define CLC1GLS0_D4N                  4047
#define LC1G1D4N                      4048
#define CLC1GLS0_D4T                  4049
#define LC1G1D4T                      4050
#define CLC1GLS1                      4051
#define CLC1GLS1_D1N                  4052
#define LC1G2D1N                      4053
#define LC1G2D1T                      4054
#define CLC1GLS1_D1T                  4055
#define CLC1GLS1_D2N                  4056
#define LC1G2D2N                      4057
#define LC1G2D2T                      4058
#define CLC1GLS1_D2T                  4059
#define CLC1GLS1_D3N                  4060
#define LC1G2D3N                      4061
#define LC1G2D3T                      4062
#define CLC1GLS1_D3T                  4063
#define CLC1GLS1_D4N                  4064
#define LC1G2D4N                      4065
#define LC1G2D4T                      4066
#define CLC1GLS1_D4T                  4067
#define CLC1GLS2                      4068
#define CLC1GLS2_D1N                  4069
#define LC1G3D1N                      4070
#define LC1G3D1T                      4071
#define CLC1GLS2_D1T                  4072
#define LC1G3D2N                      4073
#define CLC1GLS2_D2N                  4074
#define LC1G3D2T                      4075
#define CLC1GLS2_D2T                  4076
#define CLC1GLS2_D3N                  4077
#define LC1G3D3N                      4078
#define LC1G3D3T                      4079
#define CLC1GLS2_D3T                  4080
#define LC1G3D4N                      4081
#define CLC1GLS2_D4N                  4082
#define LC1G3D4T                      4083
#define CLC1GLS2_D4T                  4084
#define CLC1GLS3                      4085
#define LC1G4D1N                      4086
#define CLC1GLS3_G4D1N                4087
#define LC1G4D1T                      4088
#define CLC1GLS3_G4D1T                4089
#define CLC1GLS3_G4D2N                4090
#define LC1G4D2N                      4091
#define CLC1GLS3_G4D2T                4092
#define LC1G4D2T                      4093
#define LC1G4D3N                      4094
#define CLC1GLS3_G4D3N                4095
#define LC1G4D3T                      4096
#define CLC1GLS3_G4D3T                4097
#define CLC1GLS3_G4D4N                4098
#define LC1G4D4N                      4099
#define CLC1GLS3_G4D4T                4100
#define LC1G4D4T                      4101
#define CLC2CON                       4102
#define LC2MODE0                      4103
#define CLC2CON_MODE                  4104
#define LC2MODE                       4105
#define CLC2CON_MODE0                 4106
#define LC2MODE1                      4107
#define CLC2CON_MODE1                 4108
#define LC2MODE2                      4109
#define CLC2CON_MODE2                 4110
#define LC2INTN                       4111
#define CLC2CON_INTN                  4112
#define LC2INTP                       4113
#define CLC2CON_INTP                  4114
#define CLC2CON_OUT                   4115
#define LC2OUT                        4116
#define CLC2CON_EN                    4117
#define LC2EN                         4118
#define CLC2POL                       4119
#define LC2G1POL                      4120
#define CLC2POL_G1POL                 4121
#define LC2G2POL                      4122
#define CLC2POL_G2POL                 4123
#define LC2G3POL                      4124
#define CLC2POL_G3POL                 4125
#define LC2G4POL                      4126
#define CLC2POL_G4POL                 4127
#define CLC2POL_POL                   4128
#define LC2POL                        4129
#define CLC2SEL0                      4130
#define CLC2SEL0_D1S                  4131
#define LC2D1S0                       4132
#define CLC2SEL0_D1S0                 4133
#define LC2D1S                        4134
#define LC2D1S1                       4135
#define CLC2SEL0_D1S1                 4136
#define LC2D1S2                       4137
#define CLC2SEL0_D1S2                 4138
#define CLC2SEL0_D1S3                 4139
#define LC2D1S3                       4140
#define LC2D1S4                       4141
#define CLC2SEL0_D1S4                 4142
#define LC2D1S5                       4143
#define CLC2SEL0_D1S5                 4144
#define CLC2SEL1                      4145
#define LC2D2S0                       4146
#define CLC2SEL1_D2S0                 4147
#define LC2D2S                        4148
#define CLC2SEL1_D2S                  4149
#define LC2D2S1                       4150
#define CLC2SEL1_D2S1                 4151
#define LC2D2S2                       4152
#define CLC2SEL1_D2S2                 4153
#define LC2D2S3                       4154
#define CLC2SEL1_D2S3                 4155
#define LC2D2S4                       4156
#define CLC2SEL1_D2S4                 4157
#define LC2D2S5                       4158
#define CLC2SEL1_D2S5                 4159
#define CLC2SEL2                      4160
#define CLC2SEL2_D3S                  4161
#define LC2D3S0                       4162
#define CLC2SEL2_D3S0                 4163
#define LC2D3S                        4164
#define CLC2SEL2_D3S1                 4165
#define LC2D3S1                       4166
#define LC2D3S2                       4167
#define CLC2SEL2_D3S2                 4168
#define LC2D3S3                       4169
#define CLC2SEL2_D3S3                 4170
#define LC2D3S4                       4171
#define CLC2SEL2_D3S4                 4172
#define LC2D3S5                       4173
#define CLC2SEL2_D3S5                 4174
#define CLC2SEL3                      4175
#define LC2D4S0                       4176
#define CLC2SEL3_D4S                  4177
#define CLC2SEL3_D4S0                 4178
#define LC2D4S                        4179
#define LC2D4S1                       4180
#define CLC2SEL3_D4S1                 4181
#define LC2D4S2                       4182
#define CLC2SEL3_D4S2                 4183
#define CLC2SEL3_D4S3                 4184
#define LC2D4S3                       4185
#define LC2D4S4                       4186
#define CLC2SEL3_D4S4                 4187
#define LC2D4S5                       4188
#define CLC2SEL3_D4S5                 4189
#define CLC2GLS0                      4190
#define LC2G1D1N                      4191
#define CLC2GLS0_D1N                  4192
#define CLC2GLS0_D1T                  4193
#define LC2G1D1T                      4194
#define LC2G1D2N                      4195
#define CLC2GLS0_D2N                  4196
#define CLC2GLS0_D2T                  4197
#define LC2G1D2T                      4198
#define LC2G1D3N                      4199
#define CLC2GLS0_D3N                  4200
#define CLC2GLS0_D3T                  4201
#define LC2G1D3T                      4202
#define LC2G1D4N                      4203
#define CLC2GLS0_D4N                  4204
#define CLC2GLS0_D4T                  4205
#define LC2G1D4T                      4206
#define CLC2GLS1                      4207
#define CLC2GLS1_D1N                  4208
#define LC2G2D1N                      4209
#define CLC2GLS1_D1T                  4210
#define LC2G2D1T                      4211
#define CLC2GLS1_D2N                  4212
#define LC2G2D2N                      4213
#define CLC2GLS1_D2T                  4214
#define LC2G2D2T                      4215
#define LC2G2D3N                      4216
#define CLC2GLS1_D3N                  4217
#define LC2G2D3T                      4218
#define CLC2GLS1_D3T                  4219
#define LC2G2D4N                      4220
#define CLC2GLS1_D4N                  4221
#define LC2G2D4T                      4222
#define CLC2GLS1_D4T                  4223
#define CLC2GLS2                      4224
#define LC2G3D1N                      4225
#define CLC2GLS2_D1N                  4226
#define CLC2GLS2_D1T                  4227
#define LC2G3D1T                      4228
#define CLC2GLS2_D2N                  4229
#define LC2G3D2N                      4230
#define LC2G3D2T                      4231
#define CLC2GLS2_D2T                  4232
#define CLC2GLS2_D3N                  4233
#define LC2G3D3N                      4234
#define CLC2GLS2_D3T                  4235
#define LC2G3D3T                      4236
#define CLC2GLS2_D4N                  4237
#define LC2G3D4N                      4238
#define LC2G3D4T                      4239
#define CLC2GLS2_D4T                  4240
#define CLC2GLS3                      4241
#define LC2G4D1N                      4242
#define CLC2GLS3_G4D1N                4243
#define CLC2GLS3_G4D1T                4244
#define LC2G4D1T                      4245
#define CLC2GLS3_G4D2N                4246
#define LC2G4D2N                      4247
#define LC2G4D2T                      4248
#define CLC2GLS3_G4D2T                4249
#define CLC2GLS3_G4D3N                4250
#define LC2G4D3N                      4251
#define CLC2GLS3_G4D3T                4252
#define LC2G4D3T                      4253
#define LC2G4D4N                      4254
#define CLC2GLS3_G4D4N                4255
#define CLC2GLS3_G4D4T                4256
#define LC2G4D4T                      4257
#define CLC3CON                       4258
#define LC3MODE0                      4259
#define CLC3CON_MODE0                 4260
#define CLC3CON_MODE                  4261
#define LC3MODE                       4262
#define LC3MODE1                      4263
#define CLC3CON_MODE1                 4264
#define LC3MODE2                      4265
#define CLC3CON_MODE2                 4266
#define LC3INTN                       4267
#define CLC3CON_INTN                  4268
#define CLC3CON_INTP                  4269
#define LC3INTP                       4270
#define CLC3CON_OUT                   4271
#define LC3OUT                        4272
#define LC3EN                         4273
#define CLC3CON_EN                    4274
#define CLC3POL                       4275
#define LC3G1POL                      4276
#define CLC3POL_G1POL                 4277
#define LC3G2POL                      4278
#define CLC3POL_G2POL                 4279
#define CLC3POL_G3POL                 4280
#define LC3G3POL                      4281
#define LC3G4POL                      4282
#define CLC3POL_G4POL                 4283
#define LC3POL                        4284
#define CLC3POL_POL                   4285
#define CLC3SEL0                      4286
#define CLC3SEL0_D1S0                 4287
#define LC3D1S0                       4288
#define CLC3SEL0_D1S                  4289
#define LC3D1S                        4290
#define LC3D1S1                       4291
#define CLC3SEL0_D1S1                 4292
#define LC3D1S2                       4293
#define CLC3SEL0_D1S2                 4294
#define LC3D1S3                       4295
#define CLC3SEL0_D1S3                 4296
#define LC3D1S4                       4297
#define CLC3SEL0_D1S4                 4298
#define LC3D1S5                       4299
#define CLC3SEL0_D1S5                 4300
#define CLC3SEL1                      4301
#define CLC3SEL1_D2S                  4302
#define CLC3SEL1_D2S0                 4303
#define LC3D2S                        4304
#define LC3D2S0                       4305
#define CLC3SEL1_D2S1                 4306
#define LC3D2S1                       4307
#define CLC3SEL1_D2S2                 4308
#define LC3D2S2                       4309
#define CLC3SEL1_D2S3                 4310
#define LC3D2S3                       4311
#define CLC3SEL1_D2S4                 4312
#define LC3D2S4                       4313
#define CLC3SEL1_D2S5                 4314
#define LC3D2S5                       4315
#define CLC3SEL2                      4316
#define LC3D3S                        4317
#define CLC3SEL2_D3S                  4318
#define LC3D3S0                       4319
#define CLC3SEL2_D3S0                 4320
#define LC3D3S1                       4321
#define CLC3SEL2_D3S1                 4322
#define LC3D3S2                       4323
#define CLC3SEL2_D3S2                 4324
#define LC3D3S3                       4325
#define CLC3SEL2_D3S3                 4326
#define CLC3SEL2_D3S4                 4327
#define LC3D3S4                       4328
#define CLC3SEL2_D3S5                 4329
#define LC3D3S5                       4330
#define CLC3SEL3                      4331
#define CLC3SEL3_D4S0                 4332
#define LC3D4S0                       4333
#define CLC3SEL3_D4S                  4334
#define LC3D4S                        4335
#define LC3D4S1                       4336
#define CLC3SEL3_D4S1                 4337
#define LC3D4S2                       4338
#define CLC3SEL3_D4S2                 4339
#define LC3D4S3                       4340
#define CLC3SEL3_D4S3                 4341
#define LC3D4S4                       4342
#define CLC3SEL3_D4S4                 4343
#define LC3D4S5                       4344
#define CLC3SEL3_D4S5                 4345
#define CLC3GLS0                      4346
#define CLC3GLS0_D1N                  4347
#define LC3G1D1N                      4348
#define LC3G1D1T                      4349
#define CLC3GLS0_D1T                  4350
#define LC3G1D2N                      4351
#define CLC3GLS0_D2N                  4352
#define CLC3GLS0_D2T                  4353
#define LC3G1D2T                      4354
#define CLC3GLS0_D3N                  4355
#define LC3G1D3N                      4356
#define LC3G1D3T                      4357
#define CLC3GLS0_D3T                  4358
#define CLC3GLS0_D4N                  4359
#define LC3G1D4N                      4360
#define CLC3GLS0_D4T                  4361
#define LC3G1D4T                      4362
#define CLC3GLS1                      4363
#define LC3G2D1N                      4364
#define CLC3GLS1_D1N                  4365
#define CLC3GLS1_D1T                  4366
#define LC3G2D1T                      4367
#define LC3G2D2N                      4368
#define CLC3GLS1_D2N                  4369
#define LC3G2D2T                      4370
#define CLC3GLS1_D2T                  4371
#define LC3G2D3N                      4372
#define CLC3GLS1_D3N                  4373
#define CLC3GLS1_D3T                  4374
#define LC3G2D3T                      4375
#define LC3G2D4N                      4376
#define CLC3GLS1_D4N                  4377
#define LC3G2D4T                      4378
#define CLC3GLS1_D4T                  4379
#define CLC3GLS2                      4380
#define LC3G3D1N                      4381
#define CLC3GLS2_D1N                  4382
#define LC3G3D1T                      4383
#define CLC3GLS2_D1T                  4384
#define CLC3GLS2_D2N                  4385
#define LC3G3D2N                      4386
#define CLC3GLS2_D2T                  4387
#define LC3G3D2T                      4388
#define CLC3GLS2_D3N                  4389
#define LC3G3D3N                      4390
#define LC3G3D3T                      4391
#define CLC3GLS2_D3T                  4392
#define CLC3GLS2_D4N                  4393
#define LC3G3D4N                      4394
#define CLC3GLS2_D4T                  4395
#define LC3G3D4T                      4396
#define CLC3GLS3                      4397
#define LC3G4D1N                      4398
#define CLC3GLS3_G4D1N                4399
#define LC3G4D1T                      4400
#define CLC3GLS3_G4D1T                4401
#define LC3G4D2N                      4402
#define CLC3GLS3_G4D2N                4403
#define CLC3GLS3_G4D2T                4404
#define LC3G4D2T                      4405
#define LC3G4D3N                      4406
#define CLC3GLS3_G4D3N                4407
#define CLC3GLS3_G4D3T                4408
#define LC3G4D3T                      4409
#define LC3G4D4N                      4410
#define CLC3GLS3_G4D4N                4411
#define LC3G4D4T                      4412
#define CLC3GLS3_G4D4T                4413
#define CLC4CON                       4414
#define LC4MODE                       4415
#define CLC4CON_MODE                  4416
#define LC4MODE0                      4417
#define CLC4CON_MODE0                 4418
#define LC4MODE1                      4419
#define CLC4CON_MODE1                 4420
#define LC4MODE2                      4421
#define CLC4CON_MODE2                 4422
#define LC4INTN                       4423
#define CLC4CON_INTN                  4424
#define CLC4CON_INTP                  4425
#define LC4INTP                       4426
#define CLC4CON_OUT                   4427
#define LC4OUT                        4428
#define CLC4CON_EN                    4429
#define LC4EN                         4430
#define CLC4POL                       4431
#define CLC4POL_G1POL                 4432
#define LC4G1POL                      4433
#define CLC4POL_G2POL                 4434
#define LC4G2POL                      4435
#define CLC4POL_G3POL                 4436
#define LC4G3POL                      4437
#define LC4G4POL                      4438
