tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1776_tdd.h
#define CLC4POL_G4POL                 4439
#define LC4POL                        4440
#define CLC4POL_POL                   4441
#define CLC4SEL0                      4442
#define CLC4SEL0_D1S0                 4443
#define LC4D1S0                       4444
#define CLC4SEL0_D1S                  4445
#define LC4D1S                        4446
#define CLC4SEL0_D1S1                 4447
#define LC4D1S1                       4448
#define CLC4SEL0_D1S2                 4449
#define LC4D1S2                       4450
#define CLC4SEL0_D1S3                 4451
#define LC4D1S3                       4452
#define CLC4SEL0_D1S4                 4453
#define LC4D1S4                       4454
#define CLC4SEL0_D1S5                 4455
#define LC4D1S5                       4456
#define CLC4SEL1                      4457
#define LC4D2S0                       4458
#define CLC4SEL1_D2S                  4459
#define CLC4SEL1_D2S0                 4460
#define LC4D2S                        4461
#define CLC4SEL1_D2S1                 4462
#define LC4D2S1                       4463
#define LC4D2S2                       4464
#define CLC4SEL1_D2S2                 4465
#define LC4D2S3                       4466
#define CLC4SEL1_D2S3                 4467
#define LC4D2S4                       4468
#define CLC4SEL1_D2S4                 4469
#define LC4D2S5                       4470
#define CLC4SEL1_D2S5                 4471
#define CLC4SEL2                      4472
#define LC4D3S                        4473
#define CLC4SEL2_D3S                  4474
#define CLC4SEL2_D3S0                 4475
#define LC4D3S0                       4476
#define LC4D3S1                       4477
#define CLC4SEL2_D3S1                 4478
#define CLC4SEL2_D3S2                 4479
#define LC4D3S2                       4480
#define CLC4SEL2_D3S3                 4481
#define LC4D3S3                       4482
#define CLC4SEL2_D3S4                 4483
#define LC4D3S4                       4484
#define CLC4SEL2_D3S5                 4485
#define LC4D3S5                       4486
#define CLC4SEL3                      4487
#define LC4D4S0                       4488
#define LC4D4S                        4489
#define CLC4SEL3_D4S0                 4490
#define CLC4SEL3_D4S                  4491
#define LC4D4S1                       4492
#define CLC4SEL3_D4S1                 4493
#define LC4D4S2                       4494
#define CLC4SEL3_D4S2                 4495
#define LC4D4S3                       4496
#define CLC4SEL3_D4S3                 4497
#define LC4D4S4                       4498
#define CLC4SEL3_D4S4                 4499
#define LC4D4S5                       4500
#define CLC4SEL3_D4S5                 4501
#define CLC4GLS0                      4502
#define CLC4GLS0_D1N                  4503
#define LC4G1D1N                      4504
#define CLC4GLS0_D1T                  4505
#define LC4G1D1T                      4506
#define CLC4GLS0_D2N                  4507
#define LC4G1D2N                      4508
#define CLC4GLS0_D2T                  4509
#define LC4G1D2T                      4510
#define CLC4GLS0_D3N                  4511
#define LC4G1D3N                      4512
#define CLC4GLS0_D3T                  4513
#define LC4G1D3T                      4514
#define CLC4GLS0_D4N                  4515
#define LC4G1D4N                      4516
#define CLC4GLS0_D4T                  4517
#define LC4G1D4T                      4518
#define CLC4GLS1                      4519
#define CLC4GLS1_D1N                  4520
#define LC4G2D1N                      4521
#define CLC4GLS1_D1T                  4522
#define LC4G2D1T                      4523
#define LC4G2D2N                      4524
#define CLC4GLS1_D2N                  4525
#define LC4G2D2T                      4526
#define CLC4GLS1_D2T                  4527
#define CLC4GLS1_D3N                  4528
#define LC4G2D3N                      4529
#define LC4G2D3T                      4530
#define CLC4GLS1_D3T                  4531
#define CLC4GLS1_D4N                  4532
#define LC4G2D4N                      4533
#define CLC4GLS1_D4T                  4534
#define LC4G2D4T                      4535
#define CLC4GLS2                      4536
#define CLC4GLS2_D1N                  4537
#define LC4G3D1N                      4538
#define CLC4GLS2_D1T                  4539
#define LC4G3D1T                      4540
#define LC4G3D2N                      4541
#define CLC4GLS2_D2N                  4542
#define LC4G3D2T                      4543
#define CLC4GLS2_D2T                  4544
#define CLC4GLS2_D3N                  4545
#define LC4G3D3N                      4546
#define CLC4GLS2_D3T                  4547
#define LC4G3D3T                      4548
#define LC4G3D4N                      4549
#define CLC4GLS2_D4N                  4550
#define LC4G3D4T                      4551
#define CLC4GLS2_D4T                  4552
#define CLC4GLS3                      4553
#define CLC4GLS3_G4D1N                4554
#define LC4G4D1N                      4555
#define LC4G4D1T                      4556
#define CLC4GLS3_G4D1T                4557
#define LC4G4D2N                      4558
#define CLC4GLS3_G4D2N                4559
#define LC4G4D2T                      4560
#define CLC4GLS3_G4D2T                4561
#define CLC4GLS3_G4D3N                4562
#define LC4G4D3N                      4563
#define CLC4GLS3_G4D3T                4564
#define LC4G4D3T                      4565
#define LC4G4D4N                      4566
#define CLC4GLS3_G4D4N                4567
#define LC4G4D4T                      4568
#define CLC4GLS3_G4D4T                4569
#define STATUS_SHAD                   4570
#define C_SHAD                        4571
#define DC_SHAD                       4572
#define Z_SHAD                        4573
#define WREG_SHAD                     4574
#define BSR_SHAD                      4575
#define PCLATH_SHAD                   4576
#define FSR0L_SHAD                    4577
#define FSR0H_SHAD                    4578
#define FSR1L_SHAD                    4579
#define FSR1H_SHAD                    4580
#define STKPTR                        4581
#define TOSL                          4582
#define TOSH                          4583

#endif // _PIC16F1776_H_
